# Multivariable Linear Regression

In [34]:
import pandas as pd
from sklearn.linear_model import LinearRegression

In [35]:
df = pd.read_csv('hiring.csv')

In [36]:
df.head(5)

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [37]:
pip install word2number

Requirement already satisfied: word2number in ./my_project_env/lib/python3.7/site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [38]:

from word2number import w2n

In [39]:
df.isna().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [40]:
df.experience = df.experience.fillna('zero')

In [41]:
import math
median_test_score = math.floor(df['test_score(out of 10)'].median())
median_test_score

8

In [42]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(median_test_score)

In [43]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [44]:
df.isna().sum()

experience                    0
test_score(out of 10)         0
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [45]:
df.dtypes

experience                     object
test_score(out of 10)         float64
interview_score(out of 10)      int64
salary($)                       int64
dtype: object

In [46]:
df.experience = df.experience.apply(w2n.word_to_num)

In [47]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [49]:
reg = LinearRegression()

In [55]:
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df[['salary($)']])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [59]:
%matplotlib inline
import matplotlib.pyplot as plt
#plt.plot(df[['experience','test_score(out of 10)','interview_score(out of 10)']],reg.predict(df[['salary($)']]),color = 'blue')

In [62]:
reg.coef_

array([[2812.95487627, 1845.70596798, 2205.24017467]])

In [64]:
reg.predict([[5,8,10]])

array([[68620.08733624]])